Tekla.Structures.ModelInternal.GeometryImporter.GeometryType
The type of the geometry
Those values must be synchronized with dotGeometryType_e values in TeklaStructures\libdotnet\interface\dotnet_common_types.h

Tekla.Structures.ModelInternal.GeometryImporter.GeometryType.POLYGON_SECTION
A flat polygon section.

Tekla.Structures.ModelInternal.GeometryImporter.GeometryType.CYLINDRICAL_SECTION
A curved section following a bend geometry.

Tekla.Structures.ModelInternal.GeometryImporter.GeometryType.HELIX_SECTION
A helix section.